; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v3 ?v7)
		(pred_6 ?v1)
		(pred_3 ?v5)
		(pred_4 ?v5)
		(pred_1 ?v1 ?v5)
		(pred_5)
		(pred_2 ?v1))

   (:action op_3
       :parameters  (?v2 ?v8)
       :precondition (and (not-eq ?v2 ?v8) 
                          (pred_3 ?v2) (pred_3 ?v8) (pred_4 ?v2))
       :effect (and  (pred_4 ?v8)
		     (not (pred_4 ?v2))))


   (:action op_1
       :parameters (?v4 ?v6)
       :precondition  (and  (pred_6 ?v4) (pred_3 ?v6)
			    (pred_1 ?v4 ?v6) (pred_4 ?v6) (pred_5))
       :effect (and (pred_2 ?v4)
		    (not (pred_1 ?v4 ?v6)) 
		    (not (pred_5))))

   (:action op_2
       :parameters  (?v4  ?v6)
       :precondition  (and  (pred_6 ?v4) (pred_3 ?v6)
			    (pred_2 ?v4) (pred_4 ?v6))
       :effect (and (pred_1 ?v4 ?v6)
		    (pred_5)
		    (not (pred_2 ?v4)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_07 obj_05 obj_01 obj_04 
          obj_02 obj_03 obj_06 
)
(:init
(pred_3 obj_07)
(pred_3 obj_05)
(pred_3 obj_01)
(pred_3 obj_04)
(pred_6 obj_02)
(pred_6 obj_03)
(pred_6 obj_06)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(pred_5)
(pred_1 obj_02 obj_05)
(pred_1 obj_03 obj_07)
(pred_1 obj_06 obj_07)
(pred_4 obj_05)
)
(:goal
(and
(pred_1 obj_02 obj_07)
(pred_1 obj_03 obj_05)
(pred_1 obj_06 obj_07)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_02 obj_07) (pred_4 obj_01))
    (sometime-before  (pred_1 obj_03 obj_05) (pred_4 obj_01))
  )
)
)

; plan
1. (op_1 obj_02 obj_05)
   deleted: (pred_1 obj_02 obj_05) (pred_5)
   added: (pred_2 obj_02)
   goals met: 1 of 3
2. (op_3 obj_05 obj_01)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_01)
   goals met: 1 of 3
3. (op_2 obj_02 obj_01)
   deleted: (pred_2 obj_02)
   added: (pred_1 obj_02 obj_01) (pred_5)
   goals met: 1 of 3
4. (op_3 obj_01 obj_07)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_07)
   goals met: 1 of 3
5. (op_1 obj_03 obj_07)
   deleted: (pred_1 obj_03 obj_07) (pred_5)
   added: (pred_2 obj_03)
   goals met: 1 of 3
6. (op_3 obj_07 obj_05)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_05)
   goals met: 1 of 3
7. (op_2 obj_03 obj_05)
   deleted: (pred_2 obj_03)
   added: (pred_1 obj_03 obj_05) (pred_5)
   goals met: 2 of 3
8. (op_3 obj_05 obj_01)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_01)
   goals met: 2 of 3
9. (op_1 obj_02 obj_01)
   deleted: (pred_1 obj_02 obj_01) (pred_5)
   added: (pred_2 obj_02)
   goals met: 2 of 3
10. (op_3 obj_01 obj_07)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_07)
   goals met: 2 of 3
11. (op_2 obj_02 obj_07)
   deleted: (pred_2 obj_02)
   added: (pred_1 obj_02 obj_07) (pred_5)
   goals met: 3 of 3
